/*Ок. Посмотрю позже. А вот пока следующая задача.

На входе массив из N массивов различных строк (никакие две строки в
одном массиве не повторяются). В каждом из вложенных массивов есть
хотя бы одна строка.

Например,N=3 массива:
[["a","b","c"], ["bb","cc"], ["dd","e"]]

программа выводит все возможные различные массивы длины N, где на i-м
месте -- любая строка из i-го массива во входящем массиве.

Порядок вывода всех вариантов не важен; варианты не должны повторяться.

Пример вывода для таких входных данных:
["a","bb","dd"]
["a","bb","e"]
["a","cc","dd"]
["a","cc","e"]
["b","bb","dd"]
["b","bb","e"]
["b","cc","dd"]
["b","cc","e"]
["c","bb","dd"]
["c","bb","e"]
["c","cc","dd"]
["c","cc","e"] 
*/

var bukvi = [["a","b","c"], ["bb","cc"], ["dd","e"]];

function sortArr(arr) {
    var obj = {};

    for (var i = 0; i < arr.length; i++) {
        var sort = arr[i];
        obj[sort]=true;

    }

    return Object.keys(obj);
};

console.log(sortArr(bukvi));